### Pre-processing: Restaurant data set

#### <font color= '#eb3483'> Imports and mounting to drive

In [54]:
#imports 
import pandas as pd
import numpy as np
from google.colab import drive

In [55]:
#Mount google drive
prefix = '/content/drive'
from google.colab import drive
drive.mount(prefix, force_remount=True)

Mounted at /content/drive

In [56]:
path = '/content/drive/My Drive/CIS 450/CIS 450 Project/restaurants.csv'

In [57]:
#load data into a dataframe
df = pd.read_csv(path, header=[0]) #-- put this back in when it downloads to drive

#df = pd.read_csv('restaurants.csv', header=[0])

df.head(5)

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (6) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

      CAMIS                       DBA       BORO  ...        BIN           BBL   NTA
0  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
1  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
2  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
3  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
4  40596549  POLLOS A LA BARASA MARIO     Queens  ...  4011093.0  4.006780e+09  QN70

[5 rows x 26 columns]

### <font color= '#eb3483'> Explore data types and values

In [58]:
#explore types
df.dtypes

CAMIS                      int64
DBA                       object
BORO                      object
BUILDING                  object
STREET                    object
ZIPCODE                  float64
PHONE                     object
CUISINE DESCRIPTION      float64
INSPECTION DATE          float64
ACTION                    object
VIOLATION CODE           float64
VIOLATION DESCRIPTION    float64
CRITICAL FLAG            float64
SCORE                    float64
GRADE                    float64
GRADE DATE               float64
RECORD DATE              float64
INSPECTION TYPE          float64
Latitude                 float64
Longitude                float64
Community Board          float64
Council District         float64
Census Tract             float64
BIN                      float64
BBL                      float64
NTA                       object
dtype: object

In [59]:
#look at all columns 
df.columns

Index(['CAMIS', 'DBA', 'BORO', 'BUILDING', 'STREET', 'ZIPCODE', 'PHONE',
       'CUISINE DESCRIPTION', 'INSPECTION DATE', 'ACTION', 'VIOLATION CODE',
       'VIOLATION DESCRIPTION', 'CRITICAL FLAG', 'SCORE', 'GRADE',
       'GRADE DATE', 'RECORD DATE', 'INSPECTION TYPE', 'Latitude', 'Longitude',
       'Community Board', 'Council District', 'Census Tract', 'BIN', 'BBL',
       'NTA'],
      dtype='object')

In [60]:
#look at shape
df.shape

(394121, 26)

In [61]:
#how many unique values do we have
df.apply('nunique').sort_values(ascending=True)[0:30]

CRITICAL FLAG                0
INSPECTION TYPE              0
RECORD DATE                  0
GRADE DATE                   0
CUISINE DESCRIPTION          0
INSPECTION DATE              0
VIOLATION CODE               0
VIOLATION DESCRIPTION        0
GRADE                        0
BORO                         6
ACTION                      13
Council District            51
Community Board             69
SCORE                      136
NTA                        193
ZIPCODE                    229
Census Tract              1190
STREET                    2409
BUILDING                  8097
BBL                      19983
BIN                      20320
DBA                      22811
Latitude                 23449
Longitude                23449
PHONE                    27311
CAMIS                    29488
dtype: int64

In [62]:
#remove duplicates
df.drop_duplicates(inplace=True)

In [63]:
#look at shape
df.shape

(134529, 26)

In [64]:
df.head(5)

       CAMIS                       DBA  ...           BBL   NTA
0   41089834         MURRAY HILL DINER  ...  1.008890e+09  MN20
4   40596549  POLLOS A LA BARASA MARIO  ...  4.006780e+09  QN70
7   40530583         CORNER GOURMET II  ...  1.001320e+09  MN24
8   50074520        EL POLLO INKA PERU  ...  4.090930e+09  QN53
16  40367241       JG MELON RESTAURANT  ...  1.014290e+09  MN31

[5 rows x 26 columns]

In [65]:
#only keep certain columns based on what we need
keep = [
        'CAMIS', 'DBA', 'BORO',
        'PHONE', 'CUISINE DESCRIPTION', 'Latitude',
        'Longitude'
]
df = df[keep]

In [66]:
df.head(5)

       CAMIS                       DBA  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 7 columns]

In [67]:
#drop duplicates again
df.drop_duplicates(inplace=True)

In [68]:
#now look at unique values of what we have
df.apply('nunique').sort_values(ascending=False)

CAMIS                  29488
PHONE                  27311
Longitude              23449
Latitude               23449
DBA                    22811
BORO                       6
CUISINE DESCRIPTION        0
dtype: int64

In [69]:
#look at shape
df.shape

(29601, 7)

In [70]:
#look at percent null values 
df.isna().sum() * 100 / df.shape[0]

CAMIS                    0.000000
DBA                      3.050573
BORO                     0.000000
PHONE                    0.013513
CUISINE DESCRIPTION    100.000000
Latitude                 0.280396
Longitude                0.280396
dtype: float64

#### <font color= pink> Column: CAMIS

In [71]:
#rename CAMIS to be more easily readable
df.rename(columns={'CAMIS': 'id'}, inplace=True)

In [72]:
df.head(5)

          id                       DBA  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 7 columns]

#### <font color= pink> Column: DBA

In [73]:
#rename DBA to be more easily readable
df.rename(columns={'DBA': 'name'}, inplace=True)

In [74]:
df.head(5)

          id                      name  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 7 columns]

In [75]:
#make values title capitalization
df.name.str.title()

0                Murray Hill Diner
4         Pollos A La Barasa Mario
7                Corner Gourmet Ii
8               El Pollo Inka Peru
16             Jg Melon Restaurant
                    ...
394060                  Unks Place
394061     Brent'S Comfort Kitchen
394084              Wicked Willy'S
394112                         NaN
394120                         NaN
Name: name, Length: 29601, dtype: object

In [76]:
df.name.isna().sum()

903

Let's drop restaurants with no name.

In [77]:
df.dropna(subset=['name'], inplace=True)

#### <font color= pink> Column: BORO

In [78]:
#rename DBA to be more easily readable
df.rename(columns={'BORO': 'borough'}, inplace=True)

In [79]:
df.borough.isna().sum()

0

#### <font color= pink> Column: CUISINE DESCRIPTION

In [80]:
#rename DBA to be more easily readable
df.rename(columns={'CUISINE DESCRIPTION': 'description'}, inplace=True)

In [81]:
df.description.isna().sum()

28698

Right now all of these values are null, so we need to figure out a way to somehow link restaurant descriptions in here.

After going back and forth about this, we decided that given the time constraints, we would be unable to scrape cuisine descriptions or restaurant types off of Yelp reviews. If we were to continue with this project, we would do this. For now, we will just drop this column.

In [82]:
df.drop(['description'], axis=1)

              id                           name  ...   Latitude  Longitude
0       41089834              MURRAY HILL DINER  ...  40.745891 -73.980104
4       40596549       POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7       40530583              CORNER GOURMET II  ...  40.714643 -74.009934
8       50074520             EL POLLO INKA PERU  ...  40.682864 -73.850875
16      40367241            JG MELON RESTAURANT  ...  40.771193 -73.959532
...          ...                            ...  ...        ...        ...
394033  50033725  SOUTH SLOPE EATERY & JUICEBAR  ...  40.667743 -73.987502
394058  50109437                         MADURA  ...  40.585662 -73.951731
394060  50110046                     UNKS PLACE  ...  40.806171 -73.940337
394061  50110085        BRENT'S COMFORT KITCHEN  ...  40.754057 -73.968562
394084  41230004                 WICKED WILLY'S  ...  40.728269 -73.999358

[28698 rows x 6 columns]

#### <font color= pink> Column: Latitude

In [83]:
#rename Latitude to be more easily readable
df.rename(columns={'Latitude': 'latitude'}, inplace=True)

In [84]:
df.latitude.isna().sum()

76

Since there are only 83 null latitude values and we need latitude in order to be able to put restaurants on a map, we will just drop instances with null latitudes.

In [85]:
#drop where latitude is null
df.dropna(subset=['latitude'], inplace=True)

In [86]:
df.latitude.isna().sum()

0

#### <font color= pink> Column: Longitude

In [87]:
#rename Longitude to be more easily readable
df.rename(columns={'Longitude': 'longitude'}, inplace=True)

In [88]:
df.longitude.isna().sum()

0

### <font color = blue> Save and export data

In [91]:
save_path = '/content/drive/My Drive/CIS 450/CIS 450 Project/restaurants_cleaned.csv'

In [92]:
df.to_csv(save_path)

### <font color= blue> Summary Statistics

In [93]:
100 * df.borough.value_counts() / df.shape[0]

Manhattan        39.329886
Brooklyn         25.284746
Queens           22.860038
Bronx             8.842848
Staten Island     3.682482
Name: borough, dtype: float64